In [3]:
import pandas as pd

In [4]:
df= pd.read_csv('Mall_Customers.csv')

In [5]:
df.head()

   CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score
0           1    Male   19                  15              39
1           2    Male   21                  15              81
2           3  Female   20                  16               6
3           4  Female   23                  16              77
4           5  Female   31                  17              40

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   CustomerID          200 non-null    int64
 1   Genre               200 non-null    object
 2   Age                 200 non-null    int64
 3   Annual_Income_(k$)  200 non-null    int64
 4   Spending_Score      200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [7]:
df.describe()

       CustomerID         Age  Annual_Income_(k$)  Spending_Score
count  200.000000  200.000000          200.000000      200.000000
mean   100.500000   38.850000           60.560000       50.200000
std     57.879185   13.969007           26.264721       25.823522
min      1.000000   18.000000           15.000000        1.000000
25%     50.750000   28.750000           41.500000       34.750000
50%    100.500000   36.000000           61.500000       50.000000
75%    150.250000   49.000000           78.000000       73.000000
max    200.000000   70.000000          137.000000       99.000000

In [8]:
df.isnull()

     CustomerID  Genre    Age  Annual_Income_(k$)  Spending_Score
0         False  False  False               False           False
1         False  False  False               False           False
2         False  False  False               False           False
3         False  False  False               False           False
4         False  False  False               False           False
..          ...    ...    ...                 ...             ...
195       False  False  False               False           False
196       False  False  False               False           False
197       False  False  False               False           False
198       False  False  False               False           False
199       False  False  False               False           False

[200 rows x 5 columns]

In [9]:
df.isnull().count()

CustomerID            200
Genre                 200
Age                   200
Annual_Income_(k$)    200
Spending_Score        200
dtype: int64

In [10]:
df.isnull().sum()

CustomerID            0
Genre                 0
Age                   0
Annual_Income_(k$)    0
Spending_Score        0
dtype: int64

In [12]:
df.dtypes

CustomerID             int64
Genre                 object
Age                    int64
Annual_Income_(k$)     int64
Spending_Score         int64
dtype: object

In [13]:
df.head()

   CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score
0           1    Male   19                  15              39
1           2    Male   21                  15              81
2           3  Female   20                  16               6
3           4  Female   23                  16              77
4           5  Female   31                  17              40

In [17]:
df=pd.read_csv("dirty_cafe_sales.csv")

In [18]:
df.head()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
0,TXN_1961373,Coffee,2,2.0,4.0,Credit Card,Takeaway,2023-09-08
1,TXN_4977031,Cake,4,3.0,12.0,Cash,In-store,2023-05-16
2,TXN_4271903,Cookie,4,1.0,ERROR,Credit Card,In-store,2023-07-19
3,TXN_7034554,Salad,2,5.0,10.0,UNKNOWN,UNKNOWN,2023-04-27
4,TXN_3160411,Coffee,2,2.0,4.0,Digital Wallet,In-store,2023-06-11

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  object
 1   Item              9667 non-null   object
 2   Quantity          9862 non-null   object
 3   Price Per Unit    9821 non-null   object
 4   Total Spent       9827 non-null   object
 5   Payment Method    7421 non-null   object
 6   Location          6735 non-null   object
 7   Transaction Date  9841 non-null   object
dtypes: object(8)
memory usage: 625.1+ KB

In [24]:
df.isnull().sum()

Transaction ID         0
Item                 333
Quantity             138
Price Per Unit       179
Total Spent          173
Payment Method      2579
Location            3265
Transaction Date     159
dtype: int64

In [27]:
df.isin(['ERROR',"UNKNOWN",""]).sum()

Transaction ID        0
Item                636
Quantity            341
Price Per Unit      354
Total Spent         329
Payment Method      599
Location            696
Transaction Date    301
dtype: int64

In [29]:
pd.to_numeric(df["Quantity"],errors='coerce')

0       2.0
1       4.0
2       4.0
3       2.0
4       2.0
       ...
9995    2.0
9996    3.0
9997    4.0
9998    3.0
9999    3.0
Name: Quantity, Length: 10000, dtype: float64

In [30]:
df['caluclated_total']=df['Quantity']* df['Price Per Unit']

TypeError: can't multiply sequence by non-int of type 'str'

In [31]:
df.plot()

TypeError: no numeric data to plot

In [32]:
df["Quantity_num"]=pd.to_numeric(df["Quantity"],errors='coerce')

In [33]:
df["Price_num"]=pd.to_numeric(df["Price Per Unit"],errors='coerce')

In [34]:
df["Total_num"]=pd.to_numeric(df["Total Spent"],errors="coerce")

In [36]:
df[["Quantity", "Quantity_num", "Price Per Unit", "Price_num", "Total Spent", "Total_num"]].head(100)

   Quantity  Quantity_num Price Per Unit  Price_num Total Spent  Total_num
0         2           2.0            2.0        2.0         4.0        4.0
1         4           4.0            3.0        3.0        12.0       12.0
2         4           4.0            1.0        1.0       ERROR        NaN
3         2           2.0            5.0        5.0        10.0       10.0
4         2           2.0            2.0        2.0         4.0        4.0
..      ...           ...            ...        ...         ...        ...
95        3           3.0            5.0        5.0        15.0       15.0
96        5           5.0            5.0        5.0        25.0       25.0
97        4           4.0            2.0        2.0         8.0        8.0
98        4           4.0            3.0        3.0        12.0       12.0
99        4           4.0            2.0        2.0         8.0        8.0

[100 rows x 6 columns]

In [37]:
df.head()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date,Quantity_num,Price_num,Total_num
0,TXN_1961373,Coffee,2,2.0,4.0,Credit Card,Takeaway,2023-09-08,2.0,2.0,4.0
1,TXN_4977031,Cake,4,3.0,12.0,Cash,In-store,2023-05-16,4.0,3.0,12.0
2,TXN_4271903,Cookie,4,1.0,ERROR,Credit Card,In-store,2023-07-19,4.0,1.0,NaN
3,TXN_7034554,Salad,2,5.0,10.0,UNKNOWN,UNKNOWN,2023-04-27,2.0,5.0,10.0
4,TXN_3160411,Coffee,2,2.0,4.0,Digital Wallet,In-store,2023-06-11,2.0,2.0,4.0

In [42]:
for col in ['Item','Payment Method','Location']:
    df[col]=(df[col]
        .str.strip()
        .str.lower()
        .replace({"error":None,"unknown":None,"":None})
                )

In [43]:
df.head()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date,Quantity_num,Price_num,Total_num
0,TXN_1961373,coffee,2,2.0,4.0,credit card,takeaway,2023-09-08,2.0,2.0,4.0
1,TXN_4977031,cake,4,3.0,12.0,cash,in-store,2023-05-16,4.0,3.0,12.0
2,TXN_4271903,cookie,4,1.0,ERROR,credit card,in-store,2023-07-19,4.0,1.0,NaN
3,TXN_7034554,salad,2,5.0,10.0,None,None,2023-04-27,2.0,5.0,10.0
4,TXN_3160411,coffee,2,2.0,4.0,digital wallet,in-store,2023-06-11,2.0,2.0,4.0

In [44]:
df[["Quantity_num","Price_num","Total_num"]].describe()

       Quantity_num    Price_num    Total_num
count   9521.000000  9467.000000  9498.000000
mean       3.028463     2.949984     8.924352
std        1.419007     1.278450     6.009919
min        1.000000     1.000000     1.000000
25%        2.000000     2.000000     4.000000
50%        3.000000     3.000000     8.000000
75%        4.000000     4.000000    12.000000
max        5.000000     5.000000    25.000000

In [45]:
(df["Quantity_num"] * df["Price_num"] == df["Total_num"]).value_counts()

True     8544
False    1456
Name: count, dtype: int64

In [49]:
df["Total_num"] = df["Quantity_num"] * df["Price_num"]

KeyError: '[nan, 7.5, 1.5, 4.5] not in index'